In [1]:
pip install pandas

Requirement already satisfied: pandas in d:\anaconda3\envs\dm\lib\site-packages (1.5.0)
Requirement already satisfied: pytz>=2020.1 in d:\anaconda3\envs\dm\lib\site-packages (from pandas) (2022.4)
Requirement already satisfied: numpy>=1.20.3 in d:\anaconda3\envs\dm\lib\site-packages (from pandas) (1.23.3)
Requirement already satisfied: python-dateutil>=2.8.1 in d:\anaconda3\envs\dm\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in d:\anaconda3\envs\dm\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [7]:
pd

In [8]:
hipandas = pd.Series([1, 2, 3, 4, 5])
print(hipandas)           #顯示Series
print(hipandas.values)    #顯示值
print(hipandas.index)     #顯示索引

0    1
1    2
2    3
3    4
4    5
dtype: int64
[1 2 3 4 5]
RangeIndex(start=0, stop=5, step=1)

In [9]:
hipandas1 = pd.Series([5, 10, 15, 20, 25, 30])
print(hipandas1)           
print(hipandas1.values)    
print(hipandas1.index)

0     5
1    10
2    15
3    20
4    25
5    30
dtype: int64
[ 5 10 15 20 25 30]
RangeIndex(start=0, stop=6, step=1)

In [8]:
dict1 = {'Taipei':'台北', 'Taichung':'台中', 'Kaohsiung':'高雄'}
city = pd.Series(dict1)
print(city)
print(city.values)
print(city.index)
print(city['Taipei'])
city

Taipei       台北
Taichung     台中
Kaohsiung    高雄
dtype: object
['台北' '台中' '高雄']
Index(['Taipei', 'Taichung', 'Kaohsiung'], dtype='object')
台北

Taipei       台北
Taichung     台中
Kaohsiung    高雄
dtype: object

In [11]:
print(dict1)

{'Taipei': '台北', 'Taichung': '台中', 'Kaohsiung': '高雄'}

In [12]:
print(city['Taichung':'Kaohsiung'])

Taichung     台中
Kaohsiung    高雄
dtype: object

In [10]:
se1 = pd.Series([1, 2, 3, 4, 5], index = ["a", "b", "c", "d", "e"])
print(se1)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
se1["a"]

1

In [60]:
se2 = pd.Series([1, 2, 3, 4, 5])
se3 = pd.Series([10, 20, 30, 40, 50])
se4 = pd.Series([100, 200, 300, 400, 500])
se5 = pd.Series([99, 98, 97, 96, 95])
df = pd.DataFrame([se2, se3, se4, se5])

df1 = pd.DataFrame([[1, 2, 3, 4, 5],
                   [10, 20, 30, 40, 50],
                   [100, 200, 300, 400, 500],
                   [99, 98, 97, 96, 95]],
                   index = ["小明", "小林", "小王", "小吳"],
                   columns = ["國文", "英文", "數學", "社會", "自然"])

In [36]:
df

     0    1    2    3    4
0    1    2    3    4    5
1   10   20   30   40   50
2  100  200  300  400  500
3   99   98   97   96   95

In [81]:
se6 = pd.Series(["小明", "小林", "小王", "小吳"])
df.index = se6
se7 = pd.Series(["國文", "英文", "數學", "社會", "自然"])
df.columns = se7
df

     國文   英文   數學   社會   自然
小明    1    2    3    4    5
小林   10   20   30   40   50
小王  100  200  300  400  500
小吳   99   98   97   96   95

In [63]:
df1

     國文   英文   數學   社會   自然
小明    1    2    3    4    5
小林   10   20   30   40   50
小王  100  200  300  400  500
小吳   99   98   97   96   95

In [11]:
scores = {'國文':{'王小明':65, '李小美':90, '陳大同':81, '林小玉':79},
          '英文':{'王小明':92, '李小美':72, '陳大同':85, '林小玉':53},
          '數學':{'王小明':78, '李小美':76, '陳大同':91, '林小玉':47},
          '自然':{'王小明':83, '李小美':93, '陳大同':89, '林小玉':94},
          '社會':{'王小明':70, '李小美':56, '陳大同':94, '林小玉':80}}
df1 = pd.DataFrame(scores)
df1
#print(df2["國文"])

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [12]:
se2 = pd.Series({'王小明':65, '李小美':90, '陳大同':81, '林小玉':79})
se3 = pd.Series({'王小明':92, '李小美':72, '陳大同':85, '林小玉':53})
se4 = pd.Series({'王小明':78, '李小美':76, '陳大同':91, '林小玉':47})
se5 = pd.Series({'王小明':83, '李小美':93, '陳大同':89, '林小玉':94})
se6 = pd.Series({'王小明':70, '李小美':56, '陳大同':94, '林小玉':80})
df2 = pd.DataFrame({ '國文':se2, '英文':se3, '數學':se4, '自然':se5, '社會':se6} )
df2

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [82]:
df4 = pd.concat([se8, se9, se10, se11, se12], axis = 1)
df4.columns = ['國文', '英文', '數學', '自然', '社會']
df4

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [87]:
df4[df4["國文"] >= 80]

     國文  英文  數學  自然  社會
李小美  90  72  76  93  56
陳大同  81  85  91  89  94

In [88]:
df4.values

array([[65, 92, 78, 83, 70],
       [90, 72, 76, 93, 56],
       [81, 85, 91, 89, 94],
       [79, 53, 47, 94, 80]], dtype=int64)

In [89]:
df4.loc["林小玉", "社會"]

80